Start data import 2019-02-08 02:26:18.198039
Stop load data time 2019-02-08 02:26:18.198039
Elapsed load data time 0:00:00
Loading Conv3D
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv3d_1 (Conv3D)            (None, 10, 98, 174, 32)   1760      
_________________________________________________________________
max_pooling3d_1 (MaxPooling3 (None, 10, 49, 87, 32)    0         
_________________________________________________________________
conv3d_2 (Conv3D)            (None, 8, 47, 85, 64)     55360     
_________________________________________________________________
max_pooling3d_2 (MaxPooling3 (None, 8, 23, 42, 64)     0         
_________________________________________________________________
conv3d_3 (Conv3D)            (None, 6, 21, 40, 128)    221312    
_________________________________________________________________
conv3d_4 (Conv3D)            (None, 4, 19, 38, 128)    442496    
_________________________________________________________________
max_pooling3d_3 (MaxPooling3 (None, 4, 9, 19, 128)     0         
_________________________________________________________________
conv3d_5 (Conv3D)            (None, 3, 8, 18, 256)     262400    
_________________________________________________________________
conv3d_6 (Conv3D)            (None, 2, 7, 17, 256)     524544    
_________________________________________________________________
max_pooling3d_4 (MaxPooling3 (None, 2, 3, 8, 256)      0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 12288)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 1024)              12583936  
_________________________________________________________________
dropout_1 (Dropout)          (None, 1024)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 1024)              1049600   
_________________________________________________________________
dropout_2 (Dropout)          (None, 1024)              0         
_________________________________________________________________
dense_3 (Dense)              (None, 4)                 4100      
=================================================================
Total params: 15,145,508
Trainable params: 15,145,508
Non-trainable params: 0
_________________________________________________________________
None
Start train data fit 2019-02-08 02:26:18.282060
Epoch 1/50
Start data import 2019-02-08 02:29:57.183639
Stop load data time 2019-02-08 02:29:57.183639
Elapsed load data time 0:00:00
Loading Conv3D
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv3d_1 (Conv3D)            (None, 10, 98, 174, 32)   1760      
_________________________________________________________________
max_pooling3d_1 (MaxPooling3 (None, 10, 49, 87, 32)    0         
_________________________________________________________________
conv3d_2 (Conv3D)            (None, 8, 47, 85, 32)     27680     
_________________________________________________________________
max_pooling3d_2 (MaxPooling3 (None, 8, 23, 42, 32)     0         
_________________________________________________________________
conv3d_3 (Conv3D)            (None, 6, 21, 40, 64)     55360     
_________________________________________________________________
conv3d_4 (Conv3D)            (None, 4, 19, 38, 64)     110656    
_________________________________________________________________
max_pooling3d_3 (MaxPooling3 (None, 4, 9, 19, 64)      0         
_________________________________________________________________
conv3d_5 (Conv3D)            (None, 3, 8, 18, 128)     65664     
_________________________________________________________________
conv3d_6 (Conv3D)            (None, 2, 7, 17, 128)     131200    
_________________________________________________________________
max_pooling3d_4 (MaxPooling3 (None, 2, 3, 8, 128)      0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 6144)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 1024)              6292480   
_________________________________________________________________
dropout_1 (Dropout)          (None, 1024)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 1024)              1049600   
_________________________________________________________________
dropout_2 (Dropout)          (None, 1024)              0         
_________________________________________________________________
dense_3 (Dense)              (None, 4)                 4100      
=================================================================
Total params: 7,738,500
Trainable params: 7,738,500
Non-trainable params: 0
_________________________________________________________________
None
Start train data fit 2019-02-08 02:29:57.266665
Epoch 1/50
Start data import 2019-02-08 02:31:08.886537
Stop load data time 2019-02-08 02:31:08.886537
Elapsed load data time 0:00:00
Loading Conv3D
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv3d_1 (Conv3D)            (None, 10, 98, 174, 32)   1760      
_________________________________________________________________
max_pooling3d_1 (MaxPooling3 (None, 10, 49, 87, 32)    0         
_________________________________________________________________
conv3d_2 (Conv3D)            (None, 8, 47, 85, 32)     27680     
_________________________________________________________________
max_pooling3d_2 (MaxPooling3 (None, 8, 23, 42, 32)     0         
_________________________________________________________________
conv3d_3 (Conv3D)            (None, 6, 21, 40, 64)     55360     
_________________________________________________________________
conv3d_4 (Conv3D)            (None, 4, 19, 38, 64)     110656    
_________________________________________________________________
max_pooling3d_3 (MaxPooling3 (None, 4, 9, 19, 64)      0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 43776)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 1024)              44827648  
_________________________________________________________________
dropout_1 (Dropout)          (None, 1024)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 1024)              1049600   
_________________________________________________________________
dropout_2 (Dropout)          (None, 1024)              0         
_________________________________________________________________
dense_3 (Dense)              (None, 4)                 4100      
=================================================================
Total params: 46,076,804
Trainable params: 46,076,804
Non-trainable params: 0
_________________________________________________________________
None
Start train data fit 2019-02-08 02:31:08.956555
Epoch 1/50
Start data import 2019-02-08 02:33:36.203181
Stop load data time 2019-02-08 02:33:36.203181
Elapsed load data time 0:00:00
Loading Conv3D
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv3d_1 (Conv3D)            (None, 10, 98, 174, 32)   1760      
_________________________________________________________________
max_pooling3d_1 (MaxPooling3 (None, 10, 49, 87, 32)    0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 10, 49, 87, 32)    0         
_________________________________________________________________
conv3d_2 (Conv3D)            (None, 8, 47, 85, 32)     27680     
_________________________________________________________________
max_pooling3d_2 (MaxPooling3 (None, 8, 23, 42, 32)     0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 8, 23, 42, 32)     0         
_________________________________________________________________
conv3d_3 (Conv3D)            (None, 6, 21, 40, 64)     55360     
_________________________________________________________________
conv3d_4 (Conv3D)            (None, 4, 19, 38, 64)     110656    
_________________________________________________________________
max_pooling3d_3 (MaxPooling3 (None, 4, 9, 19, 64)      0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 4, 9, 19, 64)      0         
_________________________________________________________________
conv3d_5 (Conv3D)            (None, 3, 8, 18, 128)     65664     
_________________________________________________________________
conv3d_6 (Conv3D)            (None, 2, 7, 17, 128)     131200    
_________________________________________________________________
max_pooling3d_4 (MaxPooling3 (None, 2, 3, 8, 128)      0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 2, 3, 8, 128)      0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 6144)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 1024)              6292480   
_________________________________________________________________
dropout_5 (Dropout)          (None, 1024)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 1024)              1049600   
_________________________________________________________________
dropout_6 (Dropout)          (None, 1024)              0         
_________________________________________________________________
dense_3 (Dense)              (None, 4)                 4100      
=================================================================
Total params: 7,738,500
Trainable params: 7,738,500
Non-trainable params: 0
_________________________________________________________________
None
Start train data fit 2019-02-08 02:33:36.310213
Epoch 1/50
Start data import 2019-02-08 02:34:49.728224
Stop load data time 2019-02-08 02:34:49.728224
Elapsed load data time 0:00:00
Loading Conv3D
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv3d_1 (Conv3D)            (None, 10, 98, 174, 32)   1760      
_________________________________________________________________
max_pooling3d_1 (MaxPooling3 (None, 10, 49, 87, 32)    0         
_________________________________________________________________
conv3d_2 (Conv3D)            (None, 8, 47, 85, 32)     27680     
_________________________________________________________________
max_pooling3d_2 (MaxPooling3 (None, 8, 23, 42, 32)     0         
_________________________________________________________________
conv3d_3 (Conv3D)            (None, 6, 21, 40, 64)     55360     
_________________________________________________________________
max_pooling3d_3 (MaxPooling3 (None, 6, 10, 20, 64)     0         
_________________________________________________________________
conv3d_4 (Conv3D)            (None, 5, 9, 19, 128)     65664     
_________________________________________________________________
max_pooling3d_4 (MaxPooling3 (None, 5, 4, 9, 128)      0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 23040)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 1024)              23593984  
_________________________________________________________________
dropout_1 (Dropout)          (None, 1024)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 1024)              1049600   
_________________________________________________________________
dropout_2 (Dropout)          (None, 1024)              0         
_________________________________________________________________
dense_3 (Dense)              (None, 4)                 4100      
=================================================================
Total params: 24,798,148
Trainable params: 24,798,148
Non-trainable params: 0
_________________________________________________________________
None
Start train data fit 2019-02-08 02:34:49.801243
Epoch 1/50
Start data import 2019-02-08 02:36:59.657323
Stop load data time 2019-02-08 02:36:59.657323
Elapsed load data time 0:00:00
Loading Conv3D
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv3d_1 (Conv3D)            (None, 10, 98, 174, 32)   1760      
_________________________________________________________________
max_pooling3d_1 (MaxPooling3 (None, 10, 49, 87, 32)    0         
_________________________________________________________________
conv3d_2 (Conv3D)            (None, 8, 47, 85, 32)     27680     
_________________________________________________________________
max_pooling3d_2 (MaxPooling3 (None, 8, 23, 42, 32)     0         
_________________________________________________________________
conv3d_3 (Conv3D)            (None, 6, 21, 40, 64)     55360     
_________________________________________________________________
conv3d_4 (Conv3D)            (None, 4, 19, 38, 64)     110656    
_________________________________________________________________
max_pooling3d_3 (MaxPooling3 (None, 4, 9, 19, 64)      0         
_________________________________________________________________
conv3d_5 (Conv3D)            (None, 3, 8, 18, 128)     65664     
_________________________________________________________________
conv3d_6 (Conv3D)            (None, 2, 7, 17, 128)     131200    
_________________________________________________________________
max_pooling3d_4 (MaxPooling3 (None, 2, 3, 8, 128)      0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 6144)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 1024)              6292480   
_________________________________________________________________
dropout_1 (Dropout)          (None, 1024)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 4)                 4100      
=================================================================
Total params: 6,688,900
Trainable params: 6,688,900
Non-trainable params: 0
_________________________________________________________________
None
Start train data fit 2019-02-08 02:36:59.730341
Epoch 1/50
